app/views/routines/_form.html.erb

    <div>
        <%= f.collection_select :product_id, Product.all, :id, :name, prompt: true %>
---
SELECT "products".* FROM "products"