app/views/routines/new.html.erb

    <%= f.label :product_id, "Select a Product" %>
    <%= f.collection_select :product_id, Product.all, :id, :title, prompt: true %>
---
SELECT "products".* FROM "products"