app/views/routines/show.html.erb

<h3>Comments & Reviews:</h3>
<% @routine.reviews.each do |r| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."routine_id" = ?  [["routine_id", 52]]