app/views/users/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."user_id" = ?  [["user_id", 15]]
---

<%current_user.products.each do |product|%>