app/controllers/products_controller.rb

    def index
        @products = Product.all.alpha
---
SELECT "products".* FROM "products"