app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("created_at", "updated_at", "content", "user_id", "routine_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2021-04-19 07:51:57.203068"], ["updated_at", "2021-04-19 07:51:57.203068"], ["content", "I Really enjoyed this product"], ["user_id", 15], ["routine_id", 47]]
---
    def create
        @review = current_user.reviews.build(review_params)
        if @review.save

SELECT "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews"
---
    def index
        if params[:routine_id] && @routine = Routine.find_by_id(params[:routine_id])
            @reviews = @routine.reviews
        else
            @reviews = Review.all