app/controllers/routines_controller.rb

    def create

        @routine = current_user.routines.build(routine_params)
        if @routine.save
---
INSERT INTO "routines" ("title", "season", "step", "created_at", "updated_at", "product_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Ham"], ["season", "Summer"], ["step", "Hydreate"], ["created_at", "2021-04-15 16:18:26.002804"], ["updated_at", "2021-04-15 16:18:26.002804"], ["product_id", 25], ["user_id", 15]]

    def index
        if params[:prouduct_id] && product = Product.find_by_id(params[:product_id])
            #nested route
            @routine = product.routines
        else
            @routines = Routine.all
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "routines".* FROM "routines"

    def update
        set_routine
        if @routine.update(routine_params)
---
UPDATE "routines" SET "product_id" = ?, "updated_at" = ? WHERE "routines"."id" = ?  [["product_id", 23], ["updated_at", "2021-04-15 16:07:37.865615"], ["id", 48]]

    def destroy
        set_routine
        @routine.destroy
---
DELETE FROM "routines" WHERE "routines"."id" = ?  [["id", 8]]

    def set_routine
        @routine = Routine.find_by(id: params[:id])
---
SELECT "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]