app/controllers/routines_controller.rb

     def set_routine
        @routine = Routine.find_by(id: params[:id])
---
SELECT "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]