app/models/routine.rb

SELECT "routines".* FROM "routines" WHERE "routines"."title" = ? AND "routines"."product_id" = ? LIMIT ?  [["title", "Ant"], ["product_id", 12], ["LIMIT", 1]]
---
    def not_a_duplicate
        # if there is already an ice cream with that flavor && brand, throw an error
        routine = Routine.find_by(title: title, product_id: product_id)