app/models/routine.rb

SELECT "products".* FROM "products" WHERE "products"."name" = ? LIMIT ?  [["name", "Sause"], ["LIMIT", 1]]
UPDATE "products" SET "user_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["user_id", 15], ["updated_at", "2021-03-29 16:16:42.912029"], ["id", 12]]
INSERT INTO "products" ("name", "created_at", "updated_at", "content", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Sause"], ["created_at", "2021-04-15 16:16:08.574121"], ["updated_at", "2021-04-15 16:16:08.574121"], ["content", "open up"], ["user_id", 15]]
---
    def product_attributes=(product)

      # self.product = Product.find_by(name: product[:name])
      if self.product = Product.find_by(name: product[:name])
        self.product.update(content: product[:content])
      else
        self.product = Product.create(product)