app/models/user.rb

    def self.find_with_omniauth(auth)
        self.find_or_create_by(uid: auth[:uid], email: auth[:email]) do |u|
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."email" IS NULL LIMIT ?  [["uid", "109308794088573052696"], ["LIMIT", 1]]