app/views/products/index.html.erb

SELECT "products".* FROM "products" WHERE "products"."user_id" = ?  [["user_id", 14]]
---

<%current_user.products.each do |product| %>